[
    {
        "id": 1,
        "title": "First Post",
        "content": "This is the content of the first post.",
        "category": "Technology",
        "is_active": false,
        "publication_date": "2024-11-05",
        "author": "John"
    },
    {
        "id": 2,
        "title": "Second Post",
        "content": "This is the content of the second post.",
        "category": "Science",
        "is_active": true,
        "publication_date": "2024-11-03",
        "author": "Jane"
    },
    {
        "id": 3,
        "title": "About Me",
        "content": "This is a page about my life and hobbies.",
        "category": "lifestyle",
        "is_active": true,
        "publication_date": "18.11.2024",
        "author": "Anonymous"
    },
    {
        "id": 4,
        "title": "Python",
        "content": "\r\nPython is an interpreted, object-oriented, high-level programming language with dynamic semantics developed by Guido van Rossum. It was originally released in 1991. Designed to be easy as well as fun, the name \"Python\" is a nod to the British comedy group Monty Python.",
        "category": "tech",
        "is_active": false,
        "publication_date": "17.11.2024",
        "author": "Anonymous"
    },
    {
        "id": 5,
        "title": "User",
        "content": "I am simple user. I do something",
        "category": "science",
        "is_active": true,
        "publication_date": "18.11.2024",
        "author": "Anonymous"
    },
    {
        "id": 6,
        "title": "Java",
        "content": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible. It is a general-purpose programming language intended to let programmers write once, run anywhere (WORA),[16] meaning that compiled Java code can run on all platforms that support Java without the need to recompile.[17] Java applications are typically compiled to bytecode that can run on any Java virtual machine (JVM) regardless of the underlying computer architecture. The syntax of Java is similar to C and C++, but has fewer low-level facilities than either of them. The Java runtime provides dynamic capabilities (such as reflection and runtime code modification) that are typically not available in traditional compiled languages.",
        "category": "tech",
        "is_active": false,
        "publication_date": "02.12.2024",
        "author": "user"
    }
]